sending-email-in-common-lisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-12 Thu 04:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sending email in common-lisp</title>
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
<meta http-equiv="Content-Security-Policy" content="style-src-elem 'self' https://wmealing.github.io;">
<link rel="stylesheet" href="index.css">
<meta name="author" content="Wade Mealing" />
<meta name="description" content="Sending email from common lisp, (CL)" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Sending email in common-lisp</h1>
<nav class="navbar-custom">
    <div class="navbar-grid">

        <div class="navbar-section">
            <a href="systems.html" style="text-decoration: none;"><h3>Systems & Distributed Programming</h3></a>
            <div class="navbar-tags">
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Erlang/OTP</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Clojure</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Lisp Flavored Erlang</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag special">Cellium (TUI Framework)</span></a>
            </div>
        </div>

        <div class="navbar-section">
            <a href="security.html" style="text-decoration: none;"><h3>Security & Kernel Research</h3></a>
            <div class="navbar-tags">
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Linux Kernel Analysis</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">eBPF</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Malware Reversing</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Rust</span></a>
            </div>
        </div>

        <div class="navbar-section">
            <a href="tooling.html" style="text-decoration: none;"><h3>Tooling & Workflow</h3></a>
            <div class="navbar-tags">
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">Emacs / Elisp</span></a>
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">CI/CD Pipelines</span></a>
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">OpenSCAD</span></a>
            </div>
        </div>

    </div>
</nav>
<div id="outline-container-org71ea965" class="outline-2">
<h2 id="org71ea965">Summary:</h2>
<div class="outline-text-2" id="text-org71ea965">
<p>
This page covers how to send an email from your common-lisp coding using the cl-smtp library using googles gmail servers.
</p>
</div>
</div>
<div id="outline-container-orgad2d307" class="outline-2">
<h2 id="orgad2d307">Introduction</h2>
<div class="outline-text-2" id="text-orgad2d307">
<p>
This post covers a working example on how to send email from the common-lisp (cl) language using googles servers.  The provided
example has been tested as an individual, and regularly used from the 'google workspace' account.
</p>
</div>
</div>
<div id="outline-container-orge32ed6f" class="outline-2">
<h2 id="orge32ed6f">Requirements:</h2>
<div class="outline-text-2" id="text-orge32ed6f">
<p>
An Application password.
</p>

<p>
<a href="https://knowledge.workspace.google.com/kb/how-to-create-app-passwords-000009237">Google detailed getting one here.</a>  One fact that was missed is that you now need 2FA
configured for the account or you can not make app passwords.
</p>
</div>
</div>
<div id="outline-container-org15940f0" class="outline-2">
<h2 id="org15940f0">The code:</h2>
<div class="outline-text-2" id="text-org15940f0">
<p>
Listed below is the common-lisp code that is required to send email.   The "password" is stored
in the environment variable GMAIL_KEY, as a single string.  Google often displays on the 'app password'
page as 4 sets of 4 characters, aka xxxx xxxx xxxx xxxx , however experience shows that there was no space required.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(ql:quickload "cl-smtp")
(ql:quickload "cl-mime")

(defun email-report (&amp;key to cc subject html)
       "Generic send SMTP mail with some TEXT to RECIEPIENTS"
       (let ((login "youraccount@gmail.com")
             (passwd (uiop:getenv "GMAIL_KEY")))

         (cl-smtp:with-smtp-mail (out "smtp.gmail.com" to cc
                                      :ssl :tls
                                      :authentication `(,login ,passwd))

           (format out "To: ~A~%" to )
           (format out "Subject: ~A~%" subject)

           (cl-mime:print-mime out (make-instance 'cl-mime:mime
                                                  :type "text" :subtype "html"
                                                  :encoding :base64
                                                  :content html) t t))))

(devar html-mail-content "&lt;html&gt;&lt;h1&gt; THis is html, but not really. &lt;/h1&gt;&lt;/html&gt;")

(email-report :to "someone@example.com"
              :cc *cc-list*
              :subject email-subject
              :html html-content)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9c6c0e3" class="outline-2">
<h2 id="org9c6c0e3">Ideas for improvement.</h2>
<div class="outline-text-2" id="text-org9c6c0e3">
</div>
<div id="outline-container-orgacefe22" class="outline-3">
<h3 id="orgacefe22">1. Secret Storage mechanism.</h3>
<div class="outline-text-3" id="text-orgacefe22">
<p>
The application password needs to be stored somewhere, my advice is not to have it stored in plaintext.
</p>

<p>
If your application is hosted on a containerized platform, you can pass it as environment variables, or
some of them have secrets file.
</p>
</div>
</div>
<div id="outline-container-org0287990" class="outline-3">
<h3 id="org0287990">2. Preventing secret leaks.</h3>
<div class="outline-text-3" id="text-org0287990">
<p>
After the secret is loaded into memory, destroy the file or environment setting so it is harder for attackers
to abuse the information.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setf (uiop:getenv "SOME_ENVIRONMENT_VARIABLE") "PASSWORD-REMOVED-FOR-SECURITY-REASONS")
</pre>
</div>

<p>
When it is loaded, use  <a href="https://github.com/rotatef/secret-values">Secret Values</a> which will prevent passwords appearing in backtraces or logs.
</p>
</div>
</div>
<div id="outline-container-orgdd62f81" class="outline-3">
<h3 id="orgdd62f81">3. Preventing accidental/intention spamming.</h3>
<div class="outline-text-3" id="text-orgdd62f81">
<p>
Your application may accidentally send out hundreds of mail if a function is run repeatedly accidentally.
It is important that the program keep an accurate, reliable mechanism to know when a limits are abused.
</p>
</div>
</div>
</div>
<div id="outline-container-org9f5a33b" class="outline-2">
<h2 id="org9f5a33b">Conclusion</h2>
</div>



<div id="outline-container-org69c309a" class="outline-2">
<h2 id="org69c309a">Resources:</h2>
<div class="outline-text-2" id="text-org69c309a">
<p>
<a href="https://gitlab.common-lisp.net/cl-smtp/cl-smtp">https://gitlab.common-lisp.net/cl-smtp/cl-smtp</a>
</p>
</div>
</div>
</div>
</body>
</html>
